---
kind: method
id: M:Autodesk.Revit.DB.SolidCurveIntersection.GetCurveSegmentExtents(System.Int32)
source: html/29753329-2fca-2833-3143-5190da1c86a0.htm
---
# Autodesk.Revit.DB.SolidCurveIntersection.GetCurveSegmentExtents Method

Gets the extents for the given curve segment generated by intersection.

## Syntax (C#)
```csharp
public CurveExtents GetCurveSegmentExtents(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - The index.

## Returns
The curve extents.

## Remarks
The parameters are raw parameters based on the raw parameter extents of the original input curve.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - index is out of range.